CA_VV/src/jbiasa/CA_VV.wsdl

<?xml version="1.0" encoding="UTF-8"?>

<!--
  This file is auto-generated by CASA. 
  Edit its content manually may cause unrecoverable errors.
-->

<definitions xmlns="http://schemas.xmlsoap.org/wsdl/"
             xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
             xmlns:xsd="http://www.w3.org/2001/XMLSchema"
             targetNamespace="CA_VV"
             xmlns:tns="CA_VV" xmlns:ns="http://j2ee.netbeans.org/wsdl/BPEL_VV/WS_VV/my_VV" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/">
    <import namespace="http://j2ee.netbeans.org/wsdl/BPEL_VV/WS_VV/my_VV" location="../jbiServiceUnits/BPEL_VV/WS_VV/my_VV.wsdl"/>
    <portType name="dummyCasaPortType"/>
    <binding name="casaBinding1" type="ns:my_VVPortType">
        <soap:binding style="rpc" transport="http://schemas.xmlsoap.org/soap/http"/>
        <operation name="my_VVOperation">
            <soap:operation/>
            <input name="input1">
                <soap:body use="literal" namespace="CA_VV"/>
            </input>
            <output name="output1">
                <soap:body use="literal" namespace="CA_VV"/>
            </output>
            <fault name="fault1">
                <soap:fault name="fault1" use="literal" namespace="CA_VV"/>
            </fault>
        </operation>
    </binding>
    <service name="CA_VVService1">
        <port name="casaPort1" binding="tns:casaBinding1">
            <soap:address location="http://localhost:${HttpDefaultPort}/CA_VVService1/casaPort1"/>
        </port>
    </service>
</definitions>
